In [17]:
import pandas as pd
import numpy as np

# Group By

In [18]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df = pd.DataFrame(data)
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

Category wise total sales

In [19]:
category = df.groupby("Category")["Sales"].sum()
category

Category
A    570
B    930
Name: Sales, dtype: int64

Store wise average sales

In [20]:
store = df.groupby("Store")["Sales"].mean()
store

Store
S1    180.0
S2    195.0
Name: Sales, dtype: float64

Category + Store wise total quantity

In [21]:
cat_store_qty = df.groupby(['Category', 'Store'])["Quantity"].sum()
cat_store_qty

Category  Store
A         S1       18
          S2       27
B         S1       40
          S2       38
Name: Quantity, dtype: int64

group by store and sum of all Sales

In [22]:
st_sales = df.groupby("Store")["Sales"].sum()
st_sales

Store
S1    720
S2    780
Name: Sales, dtype: int64

## Aggregation

In [23]:
df["Sales"].agg(["mean","min","max","std","median","count"])

mean      187.500000
min       100.000000
max       300.000000
std        66.062741
median    190.000000
count       8.000000
Name: Sales, dtype: float64

In [25]:
df.groupby("Category")["Sales"].agg(["mean","max","min","count","std","median"])

           mean  max  min  count        std  median
Category
A         142.5  200  100      4  43.493295   135.0
B         232.5  300  180      4  53.774219   225.0

In [27]:
df.groupby(["Category","Store"])["Sales"].agg(["mean","max","min","count","std","median"])

                 mean  max  min  count        std  median
Category Store
A        S1     110.0  120  100      2  14.142136   110.0
         S2     175.0  200  150      2  35.355339   175.0
B        S1     250.0  300  200      2  70.710678   250.0
         S2     215.0  250  180      2  49.497475   215.0